Core/src/Catalogs/Спецификации/Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спецификации</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ТипСтрокиСостава</name>
      <type>
        <types>EnumRef.ТипыСтрокСоставаСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyНаименованияПоставщиков</name>
      <type>
        <types>CatalogRef.AzRyНаименованияПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyПриблизительнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyРезервЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyПриоритет</name>
      <type>
        <types>CatalogRef.AzRyСпецификацииПриоритет</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyКоментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/Спецификации/Forms/ФормаСписка/Module.bsl
&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		Номенклатура = Параметры.Отбор.Владелец;
		
		ИспользоватьПодсистемуПроизводство = Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить();
		ИспользоватьПодсистемуРаботы = Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Получить();
		
		Если НЕ ЗначениеЗаполнено(Номенклатура)
			ИЛИ Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ВидРабот
			ИЛИ Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
			ИЛИ Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Операция Тогда
			
			АвтоЗаголовок = Ложь;
			Если ИспользоватьПодсистемуПроизводство И ИспользоватьПодсистемуРаботы Тогда
				Заголовок = НСтр("ka='სპეციფიკაცია ინახება მხოლოდ მარაგებისთვის და სამუშაოებისთვის';ru='Спецификации хранятся только для запасов и работ';en='Specifications are stored only for supplies and works'");
			ИначеЕсли ИспользоватьПодсистемуПроизводство Тогда
				Заголовок = НСтр("ka='სპეციფიკაციები ინახება მხოლოდ მარაგებისთვის';ru='Спецификации хранятся только для запасов';en='Specifications are stored only for stocks'");
			Иначе
				Заголовок = НСтр("ka='სპეციფიკაცია ინახება მხოლოდ სამუშაოებისთვის';ru='Спецификации хранятся только для работ';en='Specifications are stored only for work'");
			КонецЕсли;
			Элементы.Список.ТолькоПросмотр = Истина;
			
		ИначеЕсли Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас И НЕ ИспользоватьПодсистемуПроизводство Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ka='სპეციფიკაცია ინახება მხოლოდ სამუშაოებისთვის';ru='Спецификации хранятся только для работ';en='Specifications are stored only for work'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		ИначеЕсли Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа И НЕ ИспользоватьПодсистемуРаботы Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ka='სპეციფიკაციები ინახება მხოლოდ მარაგებისთვის';ru='Спецификации хранятся только для запасов';en='Specifications are stored only for stocks'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
КонецПроцедуры // ПриСозданииНаСервере()

#Область ЗамерыПроизводительности

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыСпецификации");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормыСпецификации");
	
КонецПроцедуры

#КонецОбласти
